{
  "jobs": [
    {
      "id": "1",
      "title": "Digital Marketing Manager",
      "type": "Full-Time",
      "description": "Lead our digital marketing initiatives including social media campaigns, email marketing, and SEO strategies. Experience with Google Analytics, Facebook Ads, and content creation required. Join a dynamic team focused on driving growth through innovative marketing approaches.",
      "location": "Chicago, IL",
      "salary": "$55K - $70K",
      "company": {
        "name": "BrandBoost Marketing",
        "description": "BrandBoost Marketing is a full-service digital agency helping businesses grow their online presence and reach target audiences effectively.",
        "contactEmail": "careers@brandboost.com",
        "contactPhone": "555-123-4567"
      }
    },
    {
      "id": "2",
      "title": "Data Analyst",
      "type": "Part-Time",
      "description": "Analyze complex datasets to provide actionable insights for business decisions. Proficiency in SQL, Python, and data visualization tools like Tableau required. Flexible schedule with opportunity for remote work and professional development.",
      "location": "Seattle, WA",
      "salary": "$45K - $60K",
      "company": {
        "name": "DataInsights Corp",
        "description": "DataInsights Corp specializes in turning raw data into meaningful business intelligence for companies across various industries.",
        "contactEmail": "jobs@datainsights.com",
        "contactPhone": "555-234-5678"
      }
    },
    {
      "id": "3",
      "title": "Project Manager",
      "type": "Full-Time",
      "description": "Coordinate cross-functional teams to deliver projects on time and within budget. Strong organizational skills and experience with Agile methodologies required. Lead initiative planning, resource allocation, and stakeholder communication.",
      "location": "Denver, CO",
      "salary": "$65K - $80K",
      "company": {
        "name": "ProManage Solutions",
        "description": "ProManage Solutions provides project management consulting and solutions to help organizations streamline their operations and achieve strategic goals.",
        "contactEmail": "careers@promanage.com",
        "contactPhone": "555-345-6789"
      }
    },
    {
      "id": "4",
      "title": "Graphic Designer",
      "type": "Contract",
      "description": "Create visually compelling designs for print and digital media. Expertise in Adobe Creative Suite, brand development, and layout design essential. Work on diverse projects from logos to marketing materials.",
      "location": "Los Angeles, CA",
      "salary": "$40K - $55K",
      "company": {
        "name": "Creative Minds Studio",
        "description": "Creative Minds Studio is a boutique design agency known for innovative visual solutions and award-winning creative campaigns.",
        "contactEmail": "hello@creativeminds.com",
        "contactPhone": "555-456-7890"
      }
    },
    {
      "id": "5",
      "title": "Sales Representative",
      "type": "Full-Time",
      "description": "Drive revenue growth by building relationships with new and existing clients. Strong communication skills and sales experience preferred. Competitive commission structure with opportunities for advancement and territory expansion.",
      "location": "Phoenix, AZ",
      "salary": "$50K - $75K",
      "company": {
        "name": "SalesForce Solutions",
        "description": "SalesForce Solutions provides B2B sales consulting and CRM implementation services to help businesses optimize their sales processes.",
        "contactEmail": "careers@salesforce-sol.com",
        "contactPhone": "555-567-8901"
      }
    },
    {
      "id": "6",
      "title": "Human Resources Specialist",
      "type": "Full-Time",
      "description": "Support employee lifecycle from recruitment to offboarding. Handle benefits administration, policy development, and employee relations. HR certification and experience with HRIS systems preferred.",
      "location": "Atlanta, GA",
      "salary": "$48K - $62K",
      "company": {
        "name": "TalentHub HR Services",
        "description": "TalentHub HR Services offers comprehensive human resources solutions including recruitment, training, and compliance management for growing businesses.",
        "contactEmail": "hr@talenthub.com",
        "contactPhone": "555-678-9012"
      }
    },
    {
      "id": "7",
      "title": "Content Writer",
      "type": "Remote",
      "description": "Create engaging content for websites, blogs, and social media platforms. Strong writing skills and SEO knowledge required. Experience with content management systems and ability to research diverse topics independently.",
      "location": "Remote",
      "salary": "$35K - $50K",
      "company": {
        "name": "WordCraft Media",
        "description": "WordCraft Media is a content marketing agency specializing in storytelling and brand voice development for digital platforms.",
        "contactEmail": "writers@wordcraft.com",
        "contactPhone": "555-789-0123"
      }
    },
    {
      "id": "8",
      "title": "Customer Service Manager",
      "type": "Full-Time",
      "description": "Lead customer service team to ensure exceptional client experiences. Develop training programs, monitor performance metrics, and implement process improvements. Experience in call center operations and team leadership required.",
      "location": "Orlando, FL",
      "salary": "$52K - $68K",
      "company": {
        "name": "ServiceFirst Inc",
        "description": "ServiceFirst Inc provides customer support solutions and call center services to businesses looking to enhance their customer experience.",
        "contactEmail": "careers@servicefirst.com",
        "contactPhone": "555-890-1234"
      }
    },
    {
      "id": "9",
      "title": "Financial Analyst",
      "type": "Full-Time",
      "description": "Perform financial modeling, budgeting, and forecasting to support business decisions. Strong analytical skills and proficiency in Excel required. CPA or finance degree preferred with opportunity for professional growth.",
      "location": "Dallas, TX",
      "salary": "$58K - $75K",
      "company": {
        "name": "FinanceWise Consulting",
        "description": "FinanceWise Consulting provides financial planning and analysis services to help businesses make informed strategic and operational decisions.",
        "contactEmail": "jobs@financewise.com",
        "contactPhone": "555-901-2345"
      }
    },
    {
      "id": "10",
      "title": "Operations Coordinator",
      "type": "Part-Time",
      "description": "Coordinate daily operations and ensure smooth workflow across departments. Strong organizational skills and attention to detail required. Support inventory management, scheduling, and process optimization initiatives.",
      "location": "Portland, OR",
      "salary": "$42K - $55K",
      "company": {
        "name": "OptiFlow Systems",
        "description": "OptiFlow Systems specializes in operational efficiency consulting and workflow optimization for manufacturing and service industries.",
        "contactEmail": "careers@optiflow.com",
        "contactPhone": "555-012-3456"
      }
    }
  ]
}